lllucius/DECtalk_ESPress/sdkconfig.defaults
# SPDX-License-Identifier: MIT
# Copyright (c) 2025 Leland Lucius

# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 6.0 Project Minimal Configuration
#
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_TASK_WDT_EN=n
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_TINYUSB_CDC_ENABLED=y

# Default build target.  Override with "idf.py set-target <target>"
# for other chips (e.g. esp32c6).  This must live in the common
# defaults file -- target-specific files are loaded *after* the
# target is already set, so placing it there would be circular.
CONFIG_IDF_TARGET="esp32s3"
